---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.HangerRodKit
source: html/c4877900-0bed-8a5a-9aa4-e3092d06d278.htm
---
# Autodesk.Revit.DB.FabricationPart.HangerRodKit Property

Specifies whether an ancillary kit is being used to override support rods, bolts and clips, if any. A value of 0 indicates no override is being used.

## Syntax (C#)
```csharp
public int HangerRodKit { get; set; }
```

## Remarks
For hangers only. Setting an invalid hanger rod kit will result in the property being unchanged.